tutorials/magnetoconvectionFoam/3D_cavity/constant/magneticQuantities
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      magneticQuantities;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

beta_m		1.2e-03;	// Pyromagnetic coefficient
chi0		3.5;		// Magnetic susceptibility (EFH3 TDS)
Hmax		1.0e+5;		// Maximum applied field
mag_height	5e-02;		// Magnet height
// ************************************************************************* //
