tutorials/magnetoconvectionFoam/3D_cavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    leftWall
    {
        type            fixedValue;
        value           uniform 313;
    }

    rightWall
    {
        type            fixedValue;
        value           uniform 303;
    }

    topWall
    {
        type            zeroGradient;
    }


    bottomWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type            zeroGradient;
    }
}


// ************************************************************************* //
